writingLogTemplate.tex
% Created 2022-09-10 Sat 13:06
% Intended LaTeX compiler: pdflatex
\documentclass[11pt,letterpaper]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{amsmath}
\usepackage{amsfonts}
\usepackage{amssymb}
\usepackage{makeidx}
\usepackage{graphicx}
\usepackage{hyperref}
\usepackage[letterpaper, total={7in, 9in}]{geometry}
\usepackage{datetime2}
\usepackage{minted}
\usepackage{ulem}
\usepackage{spreadtab}
%Print page numbers in the upper right corner rather than the bottom center.
\pagestyle{myheadings}
% Code for plotting table
\usepackage{pgfplots}
\usepackage{pgfplotstable}
\usepackage{booktabs}
\usepackage{array}
\usepackage{colortbl}
\pgfplotstableset{% global config, for example in the preamble
every head row/.style={before row=\toprule,after row=\midrule},
every last row/.style={after row=\bottomrule},
fixed,precision=2,
}
% todolist env from https://tex.stackexchange.com/questions/247681/how-to-create-checkbox-todo-list
% done with checkmark, wontfix with x, next with finger.
% Use square brackets around the commands: e.g., [\next]
\usepackage{enumitem,amssymb}
\newlist{todolist}{itemize}{2}
\setlist[todolist]{label=$\square$}
\usepackage{pifont}
\newcommand{\nmark}{\ding{42}}% next
\newcommand{\cmark}{\ding{51}}% checkmark
\newcommand{\xmark}{\ding{55}}% x-mark
\newcommand{\wmark}{\ding{116}}% wait mark, inverted triangle representing yield sign
\newcommand{\done}{\rlap{$\square$}{\raisebox{2pt}{\large\hspace{1pt}\cmark}}%
\hspace{-2.5pt}}
\newcommand{\wontfix}{\rlap{$\square$}{\large\hspace{1pt}\xmark}}
\newcommand{\waiting}{\rlap{\raisebox{0.18ex}{\hspace{0.17ex}\scriptsize \wmark}}$\square$}
% \newcommand{\next}{\nmark}%
\bibliographystyle{cell}
\makeindex
\title{Writing Log for hot paper}
\author{Blaine Mooers}
\date{\today}
\title{Writing log for this hot paper}
\hypersetup{
 pdfauthor={Blaine Mooers},
 pdftitle={Writing log for this hot paper},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.0.50 (Org mode 9.5.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\maketitle


\tableofcontents



\section{Why am I writing this paper?\}}
\label{sec:org930caa3}
\index{why}

What is the rationale for writing this paper?

To help advance the field.

To help win or renew a grant funding.

To establish credibility in a new field for my lab.


\section{Who is the audience of the paper?}
\label{sec:org5dda5c4}
\index{audience}



\section{Related Grant Application Specific Aims}
\label{sec:org69fb510}
\index{specifc aims}

\begin{itemize}
\item 

\item 

\item 

\item 

\item 

\item 

\item 
\end{itemize}


\section{Related projects}
\label{sec:orge574036}
\index{related projects}

Take care not to re-start a project a second time.

\begin{itemize}
\item 

\item 

\item 

\item 

\item 

\item 

\item 

\item 
\end{itemize}

\section{Potential Journals, IF}
\label{sec:orgc2fe0b5}
\index{potential journals}

\subsection{Very High Impact Journals}
\label{sec:org4a1ed19}

\begin{itemize}
\item Annals of Oncology, 51.7!
\item Cell
\item Molecular Cell
\item Nature
\item Nature Methods
\item Nature Molecular and Structural Biology
\item NPJ Precision Oncology
\item Nucleic Acids Research
\item PNAS
\item Science
\end{itemize}

\subsection{Respectable Science Journals}
\label{sec:org8da8246}

\begin{itemize}
\item Acta Cryst. Section A
\item Acta Cryst. Section B
\item Acta Cryst Section D
\item Biochemistry
\item Bioinformatics
\item Biophysical Journal
\item Cell Communication and Signaling
\item Computational and Structural Biotechnology Journal, 7.3
\item Data in Brief
\item The FEBS Journal, 5.5
\item IUCrJ
\item iScience
\item J of Appl Crystallography
\item J of Biological Chemistry
\item J of Molecular Biology
\item J of Structural Dynamics
\item J of Structural Biology
\item MethodsX
\item Opinion in Structural Biology
\item Progress in Biophysics and Molecular Biology, 3.7
\item Protein Science
\item RNA
\item Structure
\end{itemize}


\subsection{Computationtal biochemistry}
\label{sec:org0fd1f3f}

\begin{itemize}
\item Computational and Theoretical Chemistry, 1.9
\item Computational Biology and Chemistry, 2.8
\item Computers in Engineering and Science
\item Crystals
\item International Journal of Molecular Science, 6.3
\item Journal of Computational Chemistry, 3.4
\item Journal of Molecular Graphics and Modeling
\item Journal of Molecular Graphics and Modelling, 2.5
\end{itemize}


\subsection{Computing Journals}
\label{sec:orga1cccbe}

\begin{itemize}
\item CAD Computer Aided Design, 3.0
\item Computational Geometry: Theory and Applications
\item Computer Aided Geometric Design, 1.3
\item Computer Graphics Forum
\item Computers in Engineering and Science
\item Graphics $\backslash$& Visual Computing,
\item SoftwareX
\end{itemize}

\subsection{Journals about science education}
\label{sec:orgcc650f3}
\begin{itemize}
\item Biochemistry and Molecular Biology Education, 1.2
\item Biochemistry and Molecular Biology Education
\item Computers and Education, Open, no APC
\end{itemize}

\section{Potential Titles}
\label{sec:org8b6883e}
\index{titles}

\begin{itemize}
\item 

\item 

\item 

\item 

\item 
\end{itemize}


\section{Potential Keywords}
\label{sec:orgf460696}
\index{keywords}


\begin{itemize}
\item 

\item 

\item 

\item 

\item 
\end{itemize}


\section{Potential Internal Reviewers}
\label{sec:orgd669bc4}
\index{internal reviewers}

\begin{itemize}
\item 

\item 

\item 

\item 

\item 
\end{itemize}

\section{Potential External Reviewers}
\label{sec:orgc23bf44}
\index{external reviewers}

\begin{itemize}
\item Harsh Critic
\item Keen Competitor
\item 

\item 

\item 

\item 

\item 

\item 

\item 

\item 
\end{itemize}

\section{Potential Competitors}
\label{sec:orgebb6da3}
\index{competitors}

\begin{itemize}
\item 

\item 

\item 

\item 

\item 
\end{itemize}



\section{Potential Collaborators}
\label{sec:org56f1793}
\index{collabotators}

\begin{itemize}
\item 

\item 

\item 

\item 

\item 
\end{itemize}


\section{Draft Introduction}
\label{sec:orgd4fc556}
\index{Introduction}

The central hypothesis of this amazing paper is that it will be accepted on the first submission \cite{chaloner1995bayesianexperimentaldesignareview}.


\section{Draft Abstract}
\label{sec:org7975cf6}
\index{Abstract}



\section{Writing Log}
\label{sec:org998a008}

\subsection{9 September 2022}
\label{sec:org3bee405}
5 hours

\begin{itemize}
\item Answered the why
\item Identified the audience
\item Drafted the Introduction and identified the central hypothesis of the paper
\item Outlined the planned results in terms of figures and tables
\item Outlined the key discussion points
\item Drafted the abstract
\item Started a list of potential titles
\item Started list of keywords
\item Generated list of potential reviewers to suggest
\end{itemize}


\subsection{10 September 2022}
\label{sec:orgf27a3fd}
1.5 hours
Worked on the Results subsection about the more important result.


\section{Next Action}
\label{sec:orgdc57329}
\index{next action}

\begin{itemize}
\item To this next
\end{itemize}

\section{To Be Done}
\label{sec:org48e6279}
\index{To be done}

\begin{itemize}
\item 

\item 

\item 

\item 

\item 
\end{itemize}



\section{May Be Done Someday}
\label{sec:org3a473a7}

\begin{itemize}
\item write another related paper
\item 

\item 

\item 

\item 
\end{itemize}


\section{Word Count}
\label{sec:org53e6e58}
\index{word count}

The word count tends to approach a plateau in the latter stages of writing.


\begin{figure}[H]
\centering
\begin{tikzpicture}
\begin{axis}[
xlabel={Date},
ylabel={Word Count Cumulative},
% legend pos=south east,
% legend entries={},
]
\addplot table [x=Day,y=Words] {wordcount.txt};
\end{axis}
\end{tikzpicture}
\caption{Cummulative word count.}
\end{figure}

\begin{table}[]
\centering
\pgfplotstabletypeset[
columns/Date/.style={column name=Date},
columns/Day/.style={column name=Day},
columns/Word/.style={column name=Words},
]{wordcount.txt}
\caption{Date, day and wordcount.}
\label{tab:my_label}
\end{table}



\section{Glossary of jargon}
\label{sec:org186d0e3}
\index{jargon}


\begin{description}
\item [censored datacensored data] Censoring hides values from points that are too large, too small, or both. The number of data points that were censored is known, unlike the case for truncated data. Data are right-censored if the value is greater than a threshold. The data are left-censored if the value is below a threshold. The censored data can be treated as missing data. In Stan, the censored data have their own array and their mean and sigma are sampled.
\item [diminishing adaptation condition] The distance between two consecutive Markov kernels must uniformly decrease to zero.
\item [leapfrog approximation] The Metropolis-Hastings correction required by the Hamiltonian Monte Carlo.
\item [Markov Chain Monte Carlo] A class of algorithms that simulates a Markov chain whose stationary distribution is the target distribution of interest. The stationary chain generates a sample from the target distribution.
\item [No U-turn sampler] An adaptive algorithm that aims to find the best parameter settings by tracking the sample path and preventing HMC from retracing its steps in this path.
\item [overdispersion] When the observed variance is greater than the mean in count data.
\item [Poisson overdispersion] The Poisson distribution has a mean that is equal to its variance. When the observed variance is greater than the mean; this is known as overdispersion and indicates that the Poisson model is not appropriate. A common reason for overdispersikon ais the omission of relevant explanatory variables, or dependent observations. Under some circumstances, the problem of overdispersion can be solved by using quasi-likelihood estimation or a negative binomial distribution instead.
\end{description}


\section{Reminders and precautions}
\label{sec:orgda0ffc1}
\index{reminders}
\index{precautions}


\begin{itemize}
\item Develop a checklist for manuscript uploading to save time and pain
\item Check the accepted image file format early in the figure preparation process
\item 

\item 

\item 
\end{itemize}


\bibliography{AnnoBibMyBDA}
\printindex
\end{document}